Requests/CadastrarAtualizarMotorista.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:tms="http://tmsfrete.v2.targetmp.com.br">
    <soapenv:Header/>
    <soapenv:Body>
        <tms:CadastrarAtualizarMotorista>
            <tms:auth>
                <tms:Usuario>setransportes.tms</tms:Usuario>
                <tms:Senha>Se@08289</tms:Senha>
                <tms:Token></tms:Token>
            </tms:auth>
            <tms:motorista>
                <tms:Instrucao>1</tms:Instrucao>
                <tms:CPFCNPJTransportador>03235544666</tms:CPFCNPJTransportador>
                <tms:IdMotorista>0</tms:IdMotorista>
                <tms:Nome>MARCELO</tms:Nome>
                <tms:Sobrenome>GILBERTO DE FREITAS</tms:Sobrenome>
                <tms:CPF>05190787648</tms:CPF>
                <tms:NumeroRG>12582061</tms:NumeroRG>
                <tms:OrgaoEmissorRg></tms:OrgaoEmissorRg>
                <tms:DataNascimento>1983-07-05</tms:DataNascimento>
                <tms:Sexo>M</tms:Sexo>
                <tms:EstadoCivil>0</tms:EstadoCivil>
                <tms:NomePai>PATRICIO ALVES DE</tms:NomePai>
                <tms:NomeMae>MARTA HELENA DE ASSUNCAO FREITAS</tms:NomeMae>
                <tms:Email></tms:Email>
                <tms:Telefone>37 998713810</tms:Telefone>
                <tms:TelefoneCelular>37 998719987</tms:TelefoneCelular>
                <tms:Nacionalidade>0</tms:Nacionalidade>
                <tms:Endereco>RUI BARBOSA MENDONCA</tms:Endereco>
                <tms:NumeroEndereco>280</tms:NumeroEndereco>
                <tms:EnderecoComplemento>Rua RUI BARBOSA MENDONCA, 280,</tms:EnderecoComplemento>
                <tms:CEP>35620000</tms:CEP>
                <tms:Bairro>CENTRO</tms:Bairro>
                <tms:CodigoIBGEMunicipio>3100203</tms:CodigoIBGEMunicipio>
                <tms:CodigoBanco>756</tms:CodigoBanco>
                <tms:CodigoAgencia>3141</tms:CodigoAgencia>
                <tms:DigitoAgencia>0</tms:DigitoAgencia>
                <tms:ContaCorrente>27286</tms:ContaCorrente>
                <tms:DigitoContaCorrente>27286</tms:DigitoContaCorrente>
                <tms:FlagContaPoupanca>false</tms:FlagContaPoupanca>
                <tms:VariacaoContaPoupanca>0</tms:VariacaoContaPoupanca>
                <tms:Ativo>true</tms:Ativo>
            </tms:motorista>
        </tms:CadastrarAtualizarMotorista>
    </soapenv:Body>
</soapenv:Envelope>